import { IProfessor } from "@/types";

export const PROFESSORS: IProfessor[] = [
    {
        name: "Баранов Николай Николаевич",
        status: "Доктор исторических наук, заведующий кафедрой Новой и новейшей истории",
        courses: [
            "«Современная историография: организация и направления исследований (на примере Германии)»",
            "«Концепция «особого пути» в истории Германии и России: сравнительный анализ»",
        ],
        photo: "Baranov",
    },
    {
        name: "Бут Юлия Евгеньевна",
        status: "Кандидат исторических наук, профессор кафедры Новой и новейшей истории",
        courses: [
            "«Практика перевода: история и метод»",
            "«Династическая мифология: механизмы легитимации власти»",
            "«История университетов, 1200–1900 гг.»",
        ],
        photo: "But",
    },

    {
        name: "Высокова Вероника Витальевна",
        status: "Доктор исторических наук, профессор кафедры Новой и новейшей истории",
        courses: [
            "«Глобальная история: современные подходы»",
            "«Междисциплинарные подходы в современных исторических исследованиях»",
            "«Практика перевода: история и метод»",
        ],
        photo: "VVV",
    },

    {
        name: "Галкина Юлия Михайловна",
        status: "Кандидат исторических наук, доцент кафедры Новой и новейшей истории",
        courses: [
            "«От согласия к Пакту: франко-русские и франко-советские отношения в 1890-1930-е гг.»",
        ],
        photo: "Galkina",
    },

    {
        name: "Городецкая Наталья Борисовна",
        status: "Кандидат исторических наук, доцент кафедры Новой и новейшей истории",
        courses: ["«Балканы в контексте геополитических трансформаций»"],
        photo: "Gorodetskaya",
    },

    {
        name: "Жигалова Наталья Эдуардовна",
        status: "Кандидат исторических наук, доцент кафедры истории Древнего мира и Средних веков",
        courses: ["«Всемирная история: метод, проблемы, перспективы»"],
        photo: "Zhigalova",
    },

    {
        name: "Запарий Юлия Владимировна",
        status: "Кандидат исторических наук, доцент кафедры Новой и новейшей истории",
        courses: [
            "«Международные конфликты: история, теория и практика урегулирования»",
            "«Россия в процессах интернационализации и интеграции»",
        ],
        photo: "Zapariy",
    },

    {
        name: "Земцов Владимир Николаевич",
        status: "Доктор исторических наук, профессор кафедры Новой и новейшей истории",
        courses: ["«Всемирная история: метод, проблемы, перспективы»"],
        photo: "Zemtsov",
    },

    {
        name: "Кручинина Наталья Александровна",
        status: "Кандидат исторических наук, профессор кафедры Новой и новейшей истории",
        courses: ["«История британского парламентаризма»"],
        photo: "Kruchinina",
    },

    {
        name: "Кущ Татьяна Викторовна",
        status: "Доктор исторических наук, заведующая кафедрой истории Древнего мира и Средних веков",
        courses: ["«История университетов, 1200–1900 гг.»"],
        photo: "Kusch",
    },

    {
        name: "Макаров Дмитрий Игоревич",
        status: "Доктор исторических наук, профессор кафедры истории Древнего мира и Средних веков",
        courses: [
            "«Евразийский феномен: Золотая Орда»",
            "«Византинизм в России»",
        ],
        photo: "Makarov",
    },

    {
        name: "Мохов Антон Сергеевич",
        status: "Доктор исторических наук, профессор кафедры истории Древнего мира и Средних веков",
        courses: [
            "«Военное искусство европейских стран в период позднего средневековья»",
            "«Крестовые походы: религиозно-военный конфликт между Западом и Востоком»",
        ],
        photo: "Mokhov",
    },

    {
        name: "Охлупина Ирина Сергеевна",
        status: "Кандидат исторических наук, доцент кафедры истории Древнего мира и Средних веков",
        courses: ["«Святость в средние века»", "«Русско-византийские связи»"],
        photo: "Okhlupina",
    },

    {
        name: "Пашкин Николай Геннадьевич",
        status: "Кандидат исторических наук, доцент кафедры истории Древнего мира и Средних веков",
        courses: [
            "«Итальянские республики, Причерноморье и Левант в Средние века»",
            "«История схизмы и униатских соборов в Средние века»",
        ],
        photo: "Pashkin",
    },

    {
        name: "Смирнов Сергей Викторович",
        status: "Доктор исторических наук, профессор кафедры Новой и новейшей истории",
        courses: [
            "«Проблемы модернизации афро-азиатских стран в ХХ – начале XXI в.»",
            "«Русская диаспора в Китае (конец XIX – середина XX вв.)»",
            "«Россия и Китай в XIX —XXI вв.: межгосударственное и межцивилизационное взаимодействие»",
        ],
        photo: "Smirnov",
    },

    {
        name: "Чемякин Евгений Юрьевич",
        status: "Кандидат исторических наук, доцент кафедры Новой и новейшей истории",
        courses: ["«Постколониальные исследования: методы и перспективы»"],
        photo: "Chemyakin",
    },
];
